app/controllers/user_controller.rb

  def create
    user = User.new(user_params)

    if user.present?
      render json: { message: 'User already registered' }, status: :conflict
    elsif user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('venkat', 'venkatoffi@gmail.com', '$2a$12$QNr6CzISiaXWFH2yjgRwye7e9MWsADbmFQIbLAiEJcp7ovGQ3rjFW', '2025-05-29 04:43:24.501873', '2025-05-29 04:43:24.501873') RETURNING "id"